### Relationship btw College Housing and Region
https://www.usnews.com/education/best-colleges/the-short-list-college/articles/2016-05-17/10-colleges-that-charge-the-most-for-room-and-board

https://www.numbeo.com/cost-of-living/in/Berkeley

In [7]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import matplotlib
import seaborn as sns
%matplotlib inline

#### data frame

In [9]:
# example
# http://pandas.pydata.org/pandas-docs/stable/10min.html

df2 = pd.DataFrame({ 'A' : 1., \
                    'B' : pd.Timestamp('20130102'), \
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'), \
                    'D' : np.array([3] * 4,dtype='int32'), \
                    'E' : pd.Categorical(["test","train","test","train"]), \
                    'F' : 'foo' })

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

### college housing data
https://www.usnews.com/education/best-colleges/the-short-list-college/articles/2016-05-17/10-colleges-that-charge-the-most-for-room-and-board

In [14]:
#School name (state)	2015-2016 room and board	U.S. News rank and category

#New School (NY)	$17,235	127 (tie), National Universities
#CUNY—College of Staten Island	$16,832	RNP*, Regional Universities (North)
#St. John's University (NY)	$16,390	153 (tie), National Universities
#San Diego State University	$15,826	149 (tie), National Universities
#American Jewish University (CA)	$15,706	RNP, National Liberal Arts Colleges
#Emerson College (MA)	$15,700	10, Regional Universities (North)
#Southern Methodist University (TX)	$15,575	61 (tie), National Universities
#Marymount Manhattan College (NY)	$15,500	RNP, National Liberal Arts Colleges
#Smith College (MA)	$15,470	14 (tie), National Liberal Arts Colleges
#University of California—Berkeley	$15,422	20, National Universities

In [32]:
price = [17235, 16832, 16390, 15826, 15706, 15700, 15575, 15500, 15470, 15422]
college = ["New School", "CUNY", "St. John", "San Diego State","American Jewish", "Emerson","Southern Methodist", "Marymount Manhattan", "Smith", "CAL!!!!!"]
location = ["NYC", "NYC", "NYC",'San Diego','LA','Boston','Dallas','NYC','Northampton','Berkeley']

In [34]:
# a = list(zip(price, college,location))

a = []
i = 0
while i < 10:
    a.append([price[i], college[i], location[i]])
    i = i + 1

dfa = pd.DataFrame(a)
print (dfa)

       0                    1            2
0  17235           New School          NYC
1  16832                 CUNY          NYC
2  16390             St. John          NYC
3  15826      San Diego State    San Diego
4  15706      American Jewish           LA
5  15700              Emerson       Boston
6  15575   Southern Methodist       Dallas
7  15500  Marymount Manhattan          NYC
8  15470                Smith  Northampton
9  15422             CAL!!!!!     Berkeley

In [ ]:
# Food: Meal, Inexpensive Restaurant
# Transportation: Taxi 1 mile (Normal Tariff)
# Utilities (Monthly): Basic (Electricity, Heating, Water, Garbage) for 915 sq ft Apartment	
# Clothing And Shoes
# Rent Per Month: Apartment (1 bedroom) in City Centre
# Rent Per Month: Apartment (1 bedroom) Outside of Centre
# Salaries And Financing

### Data source:
https://www.numbeo.com/cost-of-living/in/Berkeley

### Seaborn
http://seaborn.pydata.org/generated/seaborn.heatmap.html

### Seaborn linear
http://seaborn.pydata.org/generated/seaborn.lmplot.html